{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"arguments": {}, "batch_input_shape": [null, 64, 64, 3], "name": "Preprocess", "function_type": "lambda", "input_dtype": "float32", "output_shape": [64, 64, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>T\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": false, "output_shape_type": "raw"}}, {"class_name": "Convolution2D", "config": {"batch_input_shape": [null, 64, 64, 3], "W_constraint": null, "nb_filter": 24, "activity_regularizer": null, "input_dtype": "float32", "b_constraint": null, "nb_row": 5, "init": "glorot_uniform", "b_regularizer": null, "name": "Conv2D1", "bias": true, "subsample": [2, 2], "border_mode": "valid", "activation": "relu", "trainable": true, "dim_ordering": "tf", "W_regularizer": null, "nb_col": 5}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "W_constraint": null, "nb_filter": 36, "activity_regularizer": null, "bias": true, "b_constraint": null, "nb_row": 5, "b_regularizer": null, "name": "Conv2D2", "subsample": [2, 2], "border_mode": "valid", "activation": "relu", "trainable": true, "dim_ordering": "tf", "W_regularizer": null, "nb_col": 5}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "W_constraint": null, "nb_filter": 48, "activity_regularizer": null, "bias": true, "b_constraint": null, "nb_row": 5, "b_regularizer": null, "name": "Conv2D3", "subsample": [2, 2], "border_mode": "valid", "activation": "relu", "trainable": true, "dim_ordering": "tf", "W_regularizer": null, "nb_col": 5}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "W_constraint": null, "nb_filter": 64, "activity_regularizer": null, "bias": true, "b_constraint": null, "nb_row": 5, "b_regularizer": null, "name": "Conv2D4", "subsample": [1, 1], "border_mode": "valid", "activation": "relu", "trainable": true, "dim_ordering": "tf", "W_regularizer": null, "nb_col": 5}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "Flatten"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "output_dim": 100, "input_dim": 64, "bias": true, "b_constraint": null, "W_constraint": null, "b_regularizer": null, "name": "FC2", "activation": "relu", "trainable": true, "W_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "output_dim": 50, "input_dim": 100, "bias": true, "b_constraint": null, "W_constraint": null, "b_regularizer": null, "name": "FC3", "activation": "relu", "trainable": true, "W_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "output_dim": 10, "input_dim": 50, "bias": true, "b_constraint": null, "W_constraint": null, "b_regularizer": null, "name": "FC4", "activation": "relu", "trainable": true, "W_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "output_dim": 1, "input_dim": 10, "bias": true, "b_constraint": null, "W_constraint": null, "b_regularizer": null, "name": "Readout", "activation": "linear", "trainable": false, "W_regularizer": null, "activity_regularizer": null}}], "keras_version": "1.2.0"}