{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"name": "Preprocess", "arguments": {}, "trainable": false, "output_shape": [64, 64, 3], "batch_input_shape": [null, 64, 64, 3], "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>G\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32", "output_shape_type": "raw"}}, {"class_name": "Convolution2D", "config": {"name": "Conv2D1", "border_mode": "valid", "nb_row": 5, "batch_input_shape": [null, 64, 64, 3], "b_regularizer": null, "nb_col": 5, "activation": "relu", "input_dtype": "float32", "dim_ordering": "tf", "W_constraint": null, "b_constraint": null, "trainable": true, "bias": true, "W_regularizer": null, "init": "glorot_uniform", "subsample": [1, 1], "nb_filter": 24, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "MaxPool1", "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"name": "Conv2D2", "border_mode": "valid", "nb_row": 5, "bias": true, "nb_col": 5, "activation": "relu", "nb_filter": 36, "W_constraint": null, "b_constraint": null, "trainable": true, "dim_ordering": "tf", "W_regularizer": null, "init": "glorot_uniform", "subsample": [1, 1], "b_regularizer": null, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "MaxPool2", "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"name": "Conv2D3", "border_mode": "valid", "nb_row": 5, "bias": true, "nb_col": 5, "activation": "relu", "nb_filter": 48, "W_constraint": null, "b_constraint": null, "trainable": true, "dim_ordering": "tf", "W_regularizer": null, "init": "glorot_uniform", "subsample": [1, 1], "b_regularizer": null, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "MaxPool3", "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"name": "Conv2D4", "border_mode": "valid", "nb_row": 3, "bias": true, "nb_col": 3, "activation": "relu", "nb_filter": 64, "W_constraint": null, "b_constraint": null, "trainable": true, "dim_ordering": "tf", "W_regularizer": null, "init": "glorot_uniform", "subsample": [1, 1], "b_regularizer": null, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "MaxPool4", "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "Flatten", "trainable": true}}, {"class_name": "Dense", "config": {"name": "FC2", "b_regularizer": null, "activation": "relu", "output_dim": 100, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "trainable": true, "bias": true, "W_regularizer": null, "input_dim": 64, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"name": "FC3", "b_regularizer": null, "activation": "relu", "output_dim": 50, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "trainable": true, "bias": true, "W_regularizer": null, "input_dim": 100, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"name": "FC4", "b_regularizer": null, "activation": "relu", "output_dim": 10, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "trainable": true, "bias": true, "W_regularizer": null, "input_dim": 50, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"name": "Readout", "b_regularizer": null, "activation": "linear", "output_dim": 1, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "trainable": false, "bias": true, "W_regularizer": null, "input_dim": 10, "activity_regularizer": null}}], "keras_version": "1.2.0"}