{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Cropping2D", "config": {"trainable": true, "batch_input_shape": [null, 160, 320, 3], "name": "Crop", "input_dtype": "float32", "cropping": [[80, 20], [1, 1]]}}, {"class_name": "AveragePooling2D", "config": {"name": "Resize", "strides": [1, 4], "pool_size": [1, 4], "trainable": false, "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Lambda", "config": {"output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u0007<stdin>\u00da\b<lambda>\f\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "Normalize", "output_shape": null, "trainable": true, "function_type": "lambda", "arguments": {}}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "b_regularizer": null, "W_constraint": null, "border_mode": "valid", "W_regularizer": null, "nb_filter": 24, "nb_col": 3, "subsample": [2, 2], "name": "Convolution2D1", "dim_ordering": "tf", "bias": true, "b_constraint": null, "nb_row": 3, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform"}}, {"class_name": "MaxPooling2D", "config": {"name": "MaxPool1", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "b_regularizer": null, "W_constraint": null, "border_mode": "valid", "W_regularizer": null, "nb_filter": 36, "nb_col": 3, "subsample": [1, 1], "name": "Convolution2D2", "dim_ordering": "tf", "bias": true, "b_constraint": null, "nb_row": 3, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform"}}, {"class_name": "MaxPooling2D", "config": {"name": "MaxPool2", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "b_regularizer": null, "W_constraint": null, "border_mode": "valid", "W_regularizer": null, "nb_filter": 48, "nb_col": 3, "subsample": [1, 1], "name": "Convolution2D3", "dim_ordering": "tf", "bias": true, "b_constraint": null, "nb_row": 3, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform"}}, {"class_name": "MaxPooling2D", "config": {"name": "MaxPool3", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "Dropout", "p": 0.1}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "Flatten"}}, {"class_name": "Dense", "config": {"output_dim": 100, "W_constraint": null, "trainable": true, "W_regularizer": null, "b_regularizer": null, "name": "FC2", "b_constraint": null, "bias": true, "activation": "relu", "input_dim": 288, "activity_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Dense", "config": {"output_dim": 50, "W_constraint": null, "trainable": true, "W_regularizer": null, "b_regularizer": null, "name": "FC3", "b_constraint": null, "bias": true, "activation": "relu", "input_dim": 100, "activity_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Dense", "config": {"output_dim": 10, "W_constraint": null, "trainable": true, "W_regularizer": null, "b_regularizer": null, "name": "FC4", "b_constraint": null, "bias": true, "activation": "relu", "input_dim": 50, "activity_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Dense", "config": {"output_dim": 1, "W_constraint": null, "trainable": false, "W_regularizer": null, "b_regularizer": null, "name": "Readout", "b_constraint": null, "bias": true, "activation": "linear", "input_dim": 10, "activity_regularizer": null, "init": "glorot_uniform"}}]}