{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Cropping2D", "config": {"trainable": true, "name": "Crop", "batch_input_shape": [null, 160, 320, 3], "input_dtype": "float32", "cropping": [[80, 20], [1, 1]]}}, {"class_name": "AveragePooling2D", "config": {"border_mode": "valid", "pool_size": [1, 4], "trainable": false, "name": "Resize", "strides": [1, 4], "dim_ordering": "tf"}}, {"class_name": "Lambda", "config": {"function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u00f4\u0001\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "name": "Normalize", "arguments": {}, "output_shape_type": "raw", "output_shape": null}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "activation": "relu", "W_regularizer": null, "b_constraint": null, "W_constraint": null, "trainable": true, "bias": true, "dim_ordering": "tf", "nb_filter": 24, "b_regularizer": null, "border_mode": "valid", "name": "Convolution2D1", "activity_regularizer": null, "subsample": [2, 2], "nb_row": 3, "init": "glorot_uniform"}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "pool_size": [2, 2], "trainable": true, "name": "MaxPool1", "strides": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "activation": "relu", "W_regularizer": null, "b_constraint": null, "W_constraint": null, "trainable": true, "bias": true, "dim_ordering": "tf", "nb_filter": 36, "b_regularizer": null, "border_mode": "valid", "name": "Convolution2D2", "activity_regularizer": null, "subsample": [1, 1], "nb_row": 3, "init": "glorot_uniform"}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "pool_size": [2, 2], "trainable": true, "name": "MaxPool2", "strides": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "activation": "relu", "W_regularizer": null, "b_constraint": null, "W_constraint": null, "trainable": true, "bias": true, "dim_ordering": "tf", "nb_filter": 48, "b_regularizer": null, "border_mode": "valid", "name": "Convolution2D3", "activity_regularizer": null, "subsample": [1, 1], "nb_row": 3, "init": "glorot_uniform"}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "pool_size": [2, 2], "trainable": true, "name": "MaxPool3", "strides": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "Dropout", "p": 0.1}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "Flatten"}}, {"class_name": "Dense", "config": {"activation": "relu", "W_regularizer": null, "input_dim": 288, "b_constraint": null, "trainable": true, "bias": true, "b_regularizer": null, "init": "glorot_uniform", "name": "FC2", "activity_regularizer": null, "output_dim": 100, "W_constraint": null}}, {"class_name": "Dense", "config": {"activation": "relu", "W_regularizer": null, "input_dim": 100, "b_constraint": null, "trainable": true, "bias": true, "b_regularizer": null, "init": "glorot_uniform", "name": "FC3", "activity_regularizer": null, "output_dim": 50, "W_constraint": null}}, {"class_name": "Dense", "config": {"activation": "relu", "W_regularizer": null, "input_dim": 50, "b_constraint": null, "trainable": true, "bias": true, "b_regularizer": null, "init": "glorot_uniform", "name": "FC4", "activity_regularizer": null, "output_dim": 10, "W_constraint": null}}, {"class_name": "Dense", "config": {"activation": "linear", "W_regularizer": null, "input_dim": 10, "b_constraint": null, "trainable": false, "bias": true, "b_regularizer": null, "init": "glorot_uniform", "name": "Readout", "activity_regularizer": null, "output_dim": 1, "W_constraint": null}}]}