{"config": [{"config": {"input_dtype": "float32", "trainable": true, "batch_input_shape": [null, 160, 320, 3], "name": "Crop", "cropping": [[80, 20], [1, 1]]}, "class_name": "Cropping2D"}, {"config": {"trainable": false, "border_mode": "valid", "pool_size": [1, 4], "strides": [1, 4], "dim_ordering": "tf", "name": "Resize"}, "class_name": "AveragePooling2D"}, {"config": {"function_type": "lambda", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u0007<stdin>\u00da\b<lambda>\f\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "output_shape": null, "name": "Normalize", "output_shape_type": "raw"}, "class_name": "Lambda"}, {"config": {"trainable": true, "bias": true, "activation": "relu", "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "nb_row": 3, "nb_filter": 24, "border_mode": "valid", "name": "Convolution2D1", "subsample": [2, 2], "b_constraint": null, "W_regularizer": null, "W_constraint": null, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf", "name": "MaxPool1"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "bias": true, "activation": "relu", "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "nb_row": 3, "nb_filter": 36, "border_mode": "valid", "name": "Convolution2D2", "subsample": [1, 1], "b_constraint": null, "W_regularizer": null, "W_constraint": null, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf", "name": "MaxPool2"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "bias": true, "activation": "relu", "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "nb_col": 3, "nb_row": 3, "nb_filter": 48, "border_mode": "valid", "name": "Convolution2D3", "subsample": [1, 1], "b_constraint": null, "W_regularizer": null, "W_constraint": null, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf", "name": "MaxPool3"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "Dropout", "p": 0.1}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "Flatten"}, "class_name": "Flatten"}, {"config": {"trainable": true, "bias": true, "activation": "relu", "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "name": "FC2", "output_dim": 100, "W_regularizer": null, "W_constraint": null, "input_dim": 288}, "class_name": "Dense"}, {"config": {"trainable": true, "bias": true, "activation": "relu", "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "name": "FC3", "output_dim": 50, "W_regularizer": null, "W_constraint": null, "input_dim": 100}, "class_name": "Dense"}, {"config": {"trainable": true, "bias": true, "activation": "relu", "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "name": "FC4", "output_dim": 10, "W_regularizer": null, "W_constraint": null, "input_dim": 50}, "class_name": "Dense"}, {"config": {"trainable": false, "bias": true, "activation": "linear", "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "name": "Readout", "output_dim": 1, "W_regularizer": null, "W_constraint": null, "input_dim": 10}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}