{"keras_version": "1.2.0", "config": [{"config": {"trainable": true, "cropping": [[80, 20], [1, 1]], "batch_input_shape": [null, 160, 320, 3], "name": "Crop", "input_dtype": "float32"}, "class_name": "Cropping2D"}, {"config": {"border_mode": "valid", "dim_ordering": "tf", "name": "Resize", "strides": [1, 4], "trainable": false, "pool_size": [1, 4]}, "class_name": "AveragePooling2D"}, {"config": {"function_type": "lambda", "output_shape": null, "name": "Normalize", "output_shape_type": "raw", "trainable": true, "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u0007<stdin>\u00da\b<lambda>\u000b\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}, "class_name": "Lambda"}, {"config": {"border_mode": "valid", "dim_ordering": "tf", "name": "Convolution2D1", "nb_row": 3, "activation": "relu", "trainable": true, "W_regularizer": null, "subsample": [2, 2], "nb_filter": 24, "b_regularizer": null, "b_constraint": null, "W_constraint": null, "bias": true, "init": "glorot_uniform", "nb_col": 3, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "dim_ordering": "tf", "name": "MaxPool1", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"border_mode": "valid", "dim_ordering": "tf", "name": "Convolution2D2", "nb_row": 3, "activation": "relu", "trainable": true, "W_regularizer": null, "subsample": [1, 1], "nb_filter": 36, "b_regularizer": null, "b_constraint": null, "W_constraint": null, "bias": true, "init": "glorot_uniform", "nb_col": 3, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "dim_ordering": "tf", "name": "MaxPool2", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"border_mode": "valid", "dim_ordering": "tf", "name": "Convolution2D3", "nb_row": 3, "activation": "relu", "trainable": true, "W_regularizer": null, "subsample": [1, 1], "nb_filter": 48, "b_regularizer": null, "b_constraint": null, "W_constraint": null, "bias": true, "init": "glorot_uniform", "nb_col": 3, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "dim_ordering": "tf", "name": "MaxPool3", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "p": 0.1, "name": "Dropout"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "Flatten"}, "class_name": "Flatten"}, {"config": {"name": "FC2", "activation": "relu", "trainable": true, "b_regularizer": null, "W_regularizer": null, "input_dim": 288, "b_constraint": null, "W_constraint": null, "output_dim": 100, "bias": true, "init": "glorot_uniform", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "FC3", "activation": "relu", "trainable": true, "b_regularizer": null, "W_regularizer": null, "input_dim": 100, "b_constraint": null, "W_constraint": null, "output_dim": 50, "bias": true, "init": "glorot_uniform", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "FC4", "activation": "relu", "trainable": true, "b_regularizer": null, "W_regularizer": null, "input_dim": 50, "b_constraint": null, "W_constraint": null, "output_dim": 10, "bias": true, "init": "glorot_uniform", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "Readout", "activation": "linear", "trainable": false, "b_regularizer": null, "W_regularizer": null, "input_dim": 10, "b_constraint": null, "W_constraint": null, "output_dim": 1, "bias": true, "init": "glorot_uniform", "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}