{"config": [{"config": {"name": "Crop", "cropping": [[80, 20], [1, 1]], "input_dtype": "float32", "trainable": true, "batch_input_shape": [null, 160, 320, 3]}, "class_name": "Cropping2D"}, {"config": {"name": "Resize", "border_mode": "valid", "trainable": false, "dim_ordering": "tf", "strides": [1, 4], "pool_size": [1, 4]}, "class_name": "AveragePooling2D"}, {"config": {"name": "Normalize", "gamma_regularizer": null, "trainable": true, "mode": 0, "epsilon": 0.001, "axis": 1, "beta_regularizer": null, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"config": {"W_regularizer": null, "nb_row": 3, "border_mode": "valid", "nb_col": 3, "trainable": true, "nb_filter": 24, "dim_ordering": "tf", "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "bias": true, "name": "Convolution2D1", "subsample": [2, 2], "activity_regularizer": null, "activation": "relu", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "MaxPool1", "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"W_regularizer": null, "nb_row": 3, "border_mode": "valid", "nb_col": 3, "trainable": true, "nb_filter": 36, "dim_ordering": "tf", "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "bias": true, "name": "Convolution2D2", "subsample": [1, 1], "activity_regularizer": null, "activation": "relu", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "MaxPool2", "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"W_regularizer": null, "nb_row": 3, "border_mode": "valid", "nb_col": 3, "trainable": true, "nb_filter": 48, "dim_ordering": "tf", "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "bias": true, "name": "Convolution2D3", "subsample": [1, 1], "activity_regularizer": null, "activation": "relu", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "MaxPool3", "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.1, "name": "Dropout", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "Flatten", "trainable": true}, "class_name": "Flatten"}, {"config": {"W_regularizer": null, "b_regularizer": null, "input_dim": 288, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "bias": true, "name": "FC2", "output_dim": 100, "activity_regularizer": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"W_regularizer": null, "b_regularizer": null, "input_dim": 100, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "bias": true, "name": "FC3", "output_dim": 50, "activity_regularizer": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"W_regularizer": null, "b_regularizer": null, "input_dim": 50, "trainable": true, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "bias": true, "name": "FC4", "output_dim": 10, "activity_regularizer": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"W_regularizer": null, "b_regularizer": null, "input_dim": 10, "trainable": false, "W_constraint": null, "init": "glorot_uniform", "b_constraint": null, "bias": true, "name": "Readout", "output_dim": 1, "activity_regularizer": null, "activation": "linear"}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}