{"config": [{"config": {"batch_input_shape": [null, 160, 320, 3], "cropping": [[80, 20], [1, 1]], "input_dtype": "float32", "name": "Crop", "trainable": true}, "class_name": "Cropping2D"}, {"config": {"pool_size": [1, 4], "trainable": false, "dim_ordering": "tf", "name": "Resize", "border_mode": "valid", "strides": [1, 4]}, "class_name": "AveragePooling2D"}, {"config": {"arguments": {}, "output_shape": null, "trainable": true, "function_type": "lambda", "name": "Normalize", "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u0007<stdin>\u00da\b<lambda>\f\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}, "class_name": "Lambda"}, {"config": {"b_regularizer": null, "nb_row": 3, "nb_col": 3, "trainable": true, "init": "glorot_uniform", "nb_filter": 24, "W_constraint": null, "name": "Convolution2D1", "activation": "relu", "W_regularizer": null, "b_constraint": null, "subsample": [2, 2], "bias": true, "border_mode": "valid", "activity_regularizer": null, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "trainable": true, "dim_ordering": "tf", "name": "MaxPool1", "border_mode": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"b_regularizer": null, "nb_row": 3, "nb_col": 3, "trainable": true, "init": "glorot_uniform", "nb_filter": 36, "W_constraint": null, "name": "Convolution2D2", "activation": "relu", "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "bias": true, "border_mode": "valid", "activity_regularizer": null, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "trainable": true, "dim_ordering": "tf", "name": "MaxPool2", "border_mode": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"b_regularizer": null, "nb_row": 3, "nb_col": 3, "trainable": true, "init": "glorot_uniform", "nb_filter": 48, "W_constraint": null, "name": "Convolution2D3", "activation": "relu", "W_regularizer": null, "b_constraint": null, "subsample": [1, 1], "bias": true, "border_mode": "valid", "activity_regularizer": null, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "trainable": true, "dim_ordering": "tf", "name": "MaxPool3", "border_mode": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "Dropout", "p": 0.1, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "Flatten", "trainable": true}, "class_name": "Flatten"}, {"config": {"b_regularizer": null, "output_dim": 100, "trainable": true, "init": "glorot_uniform", "input_dim": 288, "W_constraint": null, "name": "FC2", "activation": "relu", "W_regularizer": null, "b_constraint": null, "bias": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"b_regularizer": null, "output_dim": 50, "trainable": true, "init": "glorot_uniform", "input_dim": 100, "W_constraint": null, "name": "FC3", "activation": "relu", "W_regularizer": null, "b_constraint": null, "bias": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"b_regularizer": null, "output_dim": 10, "trainable": true, "init": "glorot_uniform", "input_dim": 50, "W_constraint": null, "name": "FC4", "activation": "relu", "W_regularizer": null, "b_constraint": null, "bias": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"b_regularizer": null, "output_dim": 1, "trainable": false, "init": "glorot_uniform", "input_dim": 10, "W_constraint": null, "name": "Readout", "activation": "linear", "W_regularizer": null, "b_constraint": null, "bias": true, "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}