{"config": [{"config": {"trainable": true, "input_dtype": "float32", "batch_input_shape": [null, 160, 320, 3], "cropping": [[80, 20], [1, 1]], "name": "Crop"}, "class_name": "Cropping2D"}, {"config": {"pool_size": [1, 4], "strides": [1, 4], "trainable": false, "dim_ordering": "tf", "border_mode": "valid", "name": "Resize"}, "class_name": "AveragePooling2D"}, {"config": {"mode": 0, "momentum": 0.99, "trainable": true, "axis": 1, "epsilon": 0.001, "beta_regularizer": null, "gamma_regularizer": null, "name": "Normalize"}, "class_name": "BatchNormalization"}, {"config": {"nb_col": 3, "W_regularizer": null, "subsample": [2, 2], "nb_filter": 24, "activation": "relu", "border_mode": "valid", "W_constraint": null, "name": "Convolution2D1", "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_row": 3, "trainable": true, "dim_ordering": "tf", "bias": true}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "dim_ordering": "tf", "border_mode": "valid", "name": "MaxPool1"}, "class_name": "MaxPooling2D"}, {"config": {"nb_col": 3, "W_regularizer": null, "subsample": [1, 1], "nb_filter": 36, "activation": "relu", "border_mode": "valid", "W_constraint": null, "name": "Convolution2D2", "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_row": 3, "trainable": true, "dim_ordering": "tf", "bias": true}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "dim_ordering": "tf", "border_mode": "valid", "name": "MaxPool2"}, "class_name": "MaxPooling2D"}, {"config": {"nb_col": 3, "W_regularizer": null, "subsample": [1, 1], "nb_filter": 48, "activation": "relu", "border_mode": "valid", "W_constraint": null, "name": "Convolution2D3", "init": "glorot_uniform", "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "nb_row": 3, "trainable": true, "dim_ordering": "tf", "bias": true}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "trainable": true, "dim_ordering": "tf", "border_mode": "valid", "name": "MaxPool3"}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.1, "trainable": true, "name": "Dropout"}, "class_name": "Dropout"}, {"config": {"name": "Flatten", "trainable": true}, "class_name": "Flatten"}, {"config": {"trainable": true, "W_regularizer": null, "activation": "relu", "input_dim": 288, "init": "glorot_uniform", "name": "FC2", "W_constraint": null, "activity_regularizer": null, "output_dim": 100, "b_regularizer": null, "bias": true, "b_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "W_regularizer": null, "activation": "relu", "input_dim": 100, "init": "glorot_uniform", "name": "FC3", "W_constraint": null, "activity_regularizer": null, "output_dim": 50, "b_regularizer": null, "bias": true, "b_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "W_regularizer": null, "activation": "relu", "input_dim": 50, "init": "glorot_uniform", "name": "FC4", "W_constraint": null, "activity_regularizer": null, "output_dim": 10, "b_regularizer": null, "bias": true, "b_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": false, "W_regularizer": null, "activation": "linear", "input_dim": 10, "init": "glorot_uniform", "name": "Readout", "W_constraint": null, "activity_regularizer": null, "output_dim": 1, "b_regularizer": null, "bias": true, "b_constraint": null}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}