{"config": [{"config": {"cropping": [[80, 20], [1, 1]], "trainable": true, "batch_input_shape": [null, 160, 320, 3], "input_dtype": "float32", "name": "Crop"}, "class_name": "Cropping2D"}, {"config": {"strides": [1, 4], "trainable": false, "border_mode": "valid", "name": "Resize", "dim_ordering": "tf", "pool_size": [1, 4]}, "class_name": "AveragePooling2D"}, {"config": {"trainable": true, "arguments": {}, "function_type": "lambda", "output_shape": null, "name": "Normalize", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u008b\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw"}, "class_name": "Lambda"}, {"config": {"activity_regularizer": null, "subsample": [2, 2], "trainable": true, "init": "glorot_uniform", "bias": true, "name": "Convolution2D1", "nb_col": 3, "activation": "relu", "b_constraint": null, "nb_filter": 24, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "W_constraint": null, "dim_ordering": "tf", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "trainable": true, "border_mode": "valid", "name": "MaxPool1", "dim_ordering": "tf", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "subsample": [1, 1], "trainable": true, "init": "glorot_uniform", "bias": true, "name": "Convolution2D2", "nb_col": 3, "activation": "relu", "b_constraint": null, "nb_filter": 36, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "W_constraint": null, "dim_ordering": "tf", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "trainable": true, "border_mode": "valid", "name": "MaxPool2", "dim_ordering": "tf", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "subsample": [1, 1], "trainable": true, "init": "glorot_uniform", "bias": true, "name": "Convolution2D3", "nb_col": 3, "activation": "relu", "b_constraint": null, "nb_filter": 48, "b_regularizer": null, "W_regularizer": null, "nb_row": 3, "W_constraint": null, "dim_ordering": "tf", "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "trainable": true, "border_mode": "valid", "name": "MaxPool3", "dim_ordering": "tf", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "Dropout", "p": 0.1}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "Flatten"}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "name": "FC2", "activation": "relu", "b_constraint": null, "b_regularizer": null, "input_dim": 288, "W_regularizer": null, "output_dim": 100, "W_constraint": null}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "name": "FC3", "activation": "relu", "b_constraint": null, "b_regularizer": null, "input_dim": 100, "W_regularizer": null, "output_dim": 50, "W_constraint": null}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "name": "FC4", "activation": "relu", "b_constraint": null, "b_regularizer": null, "input_dim": 50, "W_regularizer": null, "output_dim": 10, "W_constraint": null}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "trainable": false, "init": "glorot_uniform", "bias": true, "name": "Readout", "activation": "linear", "b_constraint": null, "b_regularizer": null, "input_dim": 10, "W_regularizer": null, "output_dim": 1, "W_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}