{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Cropping2D", "config": {"trainable": true, "batch_input_shape": [null, 160, 320, 3], "name": "Crop", "input_dtype": "float32", "cropping": [[80, 20], [1, 1]]}}, {"class_name": "AveragePooling2D", "config": {"trainable": false, "strides": [1, 4], "name": "Resize", "dim_ordering": "tf", "pool_size": [1, 4], "border_mode": "valid"}}, {"class_name": "Lambda", "config": {"trainable": true, "arguments": {}, "name": "Normalize", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u0007<stdin>\u00da\b<lambda>\u000b\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw"}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "bias": true, "W_regularizer": null, "init": "glorot_uniform", "nb_filter": 24, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "trainable": true, "name": "Convolution2D1", "dim_ordering": "tf", "nb_row": 3, "nb_col": 3, "border_mode": "valid", "b_constraint": null, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "name": "MaxPool1", "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "bias": true, "W_regularizer": null, "init": "glorot_uniform", "nb_filter": 36, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "trainable": true, "name": "Convolution2D2", "dim_ordering": "tf", "nb_row": 3, "nb_col": 3, "border_mode": "valid", "b_constraint": null, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "name": "MaxPool2", "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "bias": true, "W_regularizer": null, "init": "glorot_uniform", "nb_filter": 48, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "trainable": true, "name": "Convolution2D3", "dim_ordering": "tf", "nb_row": 3, "nb_col": 3, "border_mode": "valid", "b_constraint": null, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "name": "MaxPool3", "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.1, "name": "Dropout"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "Flatten"}}, {"class_name": "Dense", "config": {"input_dim": 288, "bias": true, "activation": "relu", "init": "glorot_uniform", "b_constraint": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "trainable": true, "name": "FC2", "output_dim": 100, "W_regularizer": null}}, {"class_name": "Dense", "config": {"input_dim": 100, "bias": true, "activation": "relu", "init": "glorot_uniform", "b_constraint": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "trainable": true, "name": "FC3", "output_dim": 50, "W_regularizer": null}}, {"class_name": "Dense", "config": {"input_dim": 50, "bias": true, "activation": "relu", "init": "glorot_uniform", "b_constraint": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "trainable": true, "name": "FC4", "output_dim": 10, "W_regularizer": null}}, {"class_name": "Dense", "config": {"input_dim": 10, "bias": true, "activation": "linear", "init": "glorot_uniform", "b_constraint": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null, "trainable": false, "name": "Readout", "output_dim": 1, "W_regularizer": null}}]}