{"config": [{"config": {"name": "Crop", "cropping": [[80, 20], [1, 1]], "input_dtype": "float32", "batch_input_shape": [null, 160, 320, 3], "trainable": true}, "class_name": "Cropping2D"}, {"config": {"border_mode": "valid", "name": "Resize", "dim_ordering": "tf", "trainable": false, "pool_size": [1, 4], "strides": [1, 4]}, "class_name": "AveragePooling2D"}, {"config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>N\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "output_shape": null, "name": "Normalize", "function_type": "lambda", "trainable": true, "arguments": {}}, "class_name": "Lambda"}, {"config": {"b_constraint": null, "activation": "relu", "bias": true, "name": "Convolution2D1", "nb_filter": 24, "W_constraint": null, "dim_ordering": "tf", "nb_col": 3, "b_regularizer": null, "trainable": true, "border_mode": "valid", "nb_row": 3, "init": "glorot_uniform", "subsample": [2, 2], "activity_regularizer": null, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "name": "MaxPool1", "dim_ordering": "tf", "trainable": true, "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"b_constraint": null, "activation": "relu", "bias": true, "name": "Convolution2D2", "nb_filter": 36, "W_constraint": null, "dim_ordering": "tf", "nb_col": 3, "b_regularizer": null, "trainable": true, "border_mode": "valid", "nb_row": 3, "init": "glorot_uniform", "subsample": [1, 1], "activity_regularizer": null, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "name": "MaxPool2", "dim_ordering": "tf", "trainable": true, "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"b_constraint": null, "activation": "relu", "bias": true, "name": "Convolution2D3", "nb_filter": 48, "W_constraint": null, "dim_ordering": "tf", "nb_col": 3, "b_regularizer": null, "trainable": true, "border_mode": "valid", "nb_row": 3, "init": "glorot_uniform", "subsample": [1, 1], "activity_regularizer": null, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "name": "MaxPool3", "dim_ordering": "tf", "trainable": true, "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "Dropout", "p": 0.1, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "Flatten", "trainable": true}, "class_name": "Flatten"}, {"config": {"b_constraint": null, "activation": "relu", "bias": true, "W_constraint": null, "name": "FC2", "output_dim": 100, "b_regularizer": null, "input_dim": 288, "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"b_constraint": null, "activation": "relu", "bias": true, "W_constraint": null, "name": "FC3", "output_dim": 50, "b_regularizer": null, "input_dim": 100, "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"b_constraint": null, "activation": "relu", "bias": true, "W_constraint": null, "name": "FC4", "output_dim": 10, "b_regularizer": null, "input_dim": 50, "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null}, "class_name": "Dense"}, {"config": {"b_constraint": null, "activation": "linear", "bias": true, "W_constraint": null, "name": "Readout", "output_dim": 1, "b_regularizer": null, "input_dim": 10, "trainable": false, "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}