{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"output_shape_type": "raw", "name": "Preprocess", "function_type": "lambda", "trainable": false, "batch_input_shape": [null, 64, 64, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>A\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": [64, 64, 3], "arguments": {}, "input_dtype": "float32"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "b_constraint": null, "nb_filter": 24, "activity_regularizer": null, "name": "Conv2D1", "nb_row": 5, "trainable": true, "b_regularizer": null, "batch_input_shape": [null, 64, 64, 3], "W_constraint": null, "border_mode": "valid", "activation": "relu", "nb_col": 5, "bias": true, "subsample": [1, 1], "input_dtype": "float32", "init": "glorot_uniform", "W_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "MaxPool1", "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "tf", "strides": [2, 2], "trainable": true}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "b_constraint": null, "nb_filter": 36, "activity_regularizer": null, "name": "Conv2D2", "nb_row": 5, "subsample": [1, 1], "b_regularizer": null, "trainable": true, "W_constraint": null, "border_mode": "valid", "activation": "relu", "nb_col": 5, "bias": true, "init": "glorot_uniform", "W_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "MaxPool2", "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "tf", "strides": [2, 2], "trainable": true}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "b_constraint": null, "nb_filter": 48, "activity_regularizer": null, "name": "Conv2D3", "nb_row": 5, "subsample": [1, 1], "b_regularizer": null, "trainable": true, "W_constraint": null, "border_mode": "valid", "activation": "relu", "nb_col": 5, "bias": true, "init": "glorot_uniform", "W_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "MaxPool3", "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "tf", "strides": [2, 2], "trainable": true}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "b_constraint": null, "nb_filter": 64, "activity_regularizer": null, "name": "Conv2D4", "nb_row": 3, "subsample": [1, 1], "b_regularizer": null, "trainable": true, "W_constraint": null, "border_mode": "valid", "activation": "relu", "nb_col": 3, "bias": true, "init": "glorot_uniform", "W_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "MaxPool4", "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "tf", "strides": [2, 2], "trainable": true}}, {"class_name": "Flatten", "config": {"name": "Flatten", "trainable": true}}, {"class_name": "Dense", "config": {"name": "FC2", "activity_regularizer": null, "b_regularizer": null, "output_dim": 100, "b_constraint": null, "trainable": true, "bias": true, "W_constraint": null, "activation": "relu", "input_dim": 64, "init": "glorot_uniform", "W_regularizer": null}}, {"class_name": "Dense", "config": {"name": "FC3", "activity_regularizer": null, "b_regularizer": null, "output_dim": 50, "b_constraint": null, "trainable": true, "bias": true, "W_constraint": null, "activation": "relu", "input_dim": 100, "init": "glorot_uniform", "W_regularizer": null}}, {"class_name": "Dense", "config": {"name": "FC4", "activity_regularizer": null, "b_regularizer": null, "output_dim": 10, "b_constraint": null, "trainable": true, "bias": true, "W_constraint": null, "activation": "relu", "input_dim": 50, "init": "glorot_uniform", "W_regularizer": null}}, {"class_name": "Dense", "config": {"name": "Readout", "activity_regularizer": null, "b_regularizer": null, "output_dim": 1, "b_constraint": null, "trainable": false, "bias": true, "W_constraint": null, "activation": "linear", "input_dim": 10, "init": "glorot_uniform", "W_regularizer": null}}], "keras_version": "1.2.0"}