{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Cropping2D", "config": {"name": "Crop", "batch_input_shape": [null, 160, 320, 3], "trainable": true, "input_dtype": "float32", "cropping": [[80, 20], [1, 1]]}}, {"class_name": "AveragePooling2D", "config": {"name": "Resize", "strides": [1, 4], "border_mode": "valid", "trainable": false, "dim_ordering": "tf", "pool_size": [1, 4]}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "momentum": 0.99, "trainable": true, "axis": 1, "name": "Normalize", "epsilon": 0.001, "mode": 0, "beta_regularizer": null}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 24, "nb_col": 3, "b_regularizer": null, "b_constraint": null, "nb_row": 3, "activity_regularizer": null, "name": "Convolution2D1", "W_constraint": null, "border_mode": "valid", "trainable": true, "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [2, 2], "activation": "relu", "bias": true}}, {"class_name": "MaxPooling2D", "config": {"name": "MaxPool1", "strides": [2, 2], "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 36, "nb_col": 3, "b_regularizer": null, "b_constraint": null, "nb_row": 3, "activity_regularizer": null, "name": "Convolution2D2", "W_constraint": null, "border_mode": "valid", "trainable": true, "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 1], "activation": "relu", "bias": true}}, {"class_name": "MaxPooling2D", "config": {"name": "MaxPool2", "strides": [2, 2], "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_filter": 48, "nb_col": 3, "b_regularizer": null, "b_constraint": null, "nb_row": 3, "activity_regularizer": null, "name": "Convolution2D3", "W_constraint": null, "border_mode": "valid", "trainable": true, "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 1], "activation": "relu", "bias": true}}, {"class_name": "MaxPooling2D", "config": {"name": "MaxPool3", "strides": [2, 2], "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "Dropout", "trainable": true, "p": 0.1}}, {"class_name": "Flatten", "config": {"name": "Flatten", "trainable": true}}, {"class_name": "Dense", "config": {"W_regularizer": null, "name": "FC2", "activation": "relu", "b_constraint": null, "activity_regularizer": null, "input_dim": 288, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "b_regularizer": null, "bias": true, "output_dim": 100}}, {"class_name": "Dense", "config": {"W_regularizer": null, "name": "FC3", "activation": "relu", "b_constraint": null, "activity_regularizer": null, "input_dim": 100, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "b_regularizer": null, "bias": true, "output_dim": 50}}, {"class_name": "Dense", "config": {"W_regularizer": null, "name": "FC4", "activation": "relu", "b_constraint": null, "activity_regularizer": null, "input_dim": 50, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "b_regularizer": null, "bias": true, "output_dim": 10}}, {"class_name": "Dense", "config": {"W_regularizer": null, "name": "Readout", "activation": "linear", "b_constraint": null, "activity_regularizer": null, "input_dim": 10, "W_constraint": null, "trainable": false, "init": "glorot_uniform", "b_regularizer": null, "bias": true, "output_dim": 1}}]}