{"class_name": "Sequential", "config": [{"class_name": "AveragePooling2D", "config": {"name": "Resize", "trainable": false, "input_dtype": "float32", "batch_input_shape": [null, 60, 320, 3], "strides": [1, 4], "pool_size": [1, 4], "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Lambda", "config": {"name": "Normalize", "output_shape": null, "trainable": true, "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00faS/home/dventimi/work/GitHub/Udacity/CarND/Project3/CarND-Behavioral-Cloning/model.py\u00da\b<lambda>\u009b\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"name": "Conv2D1", "activation": "relu", "nb_col": 3, "trainable": true, "W_constraint": null, "subsample": [2, 2], "W_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "nb_row": 3, "b_regularizer": null, "nb_filter": 24, "b_constraint": null, "init": "glorot_uniform", "bias": true, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "MaxPool1", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"name": "Conv2D2", "activation": "relu", "nb_col": 3, "trainable": true, "W_constraint": null, "subsample": [1, 1], "W_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "nb_row": 3, "b_regularizer": null, "nb_filter": 36, "b_constraint": null, "init": "glorot_uniform", "bias": true, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "MaxPool2", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.1}}, {"class_name": "Flatten", "config": {"name": "Flatten", "trainable": true}}, {"class_name": "Dense", "config": {"name": "FC2", "activation": "relu", "trainable": true, "W_constraint": null, "output_dim": 100, "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "input_dim": 1728, "b_constraint": null, "bias": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"name": "FC3", "activation": "relu", "trainable": true, "W_constraint": null, "output_dim": 50, "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "input_dim": 100, "b_constraint": null, "bias": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"name": "FC4", "activation": "relu", "trainable": true, "W_constraint": null, "output_dim": 10, "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "input_dim": 50, "b_constraint": null, "bias": true, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"name": "Readout", "activation": "linear", "trainable": false, "W_constraint": null, "output_dim": 1, "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "input_dim": 10, "b_constraint": null, "bias": true, "activity_regularizer": null}}], "keras_version": "1.2.0"}