{"keras_version": "1.2.0", "config": [{"config": {"function_type": "lambda", "arguments": {}, "input_dtype": "float32", "trainable": false, "output_shape_type": "raw", "batch_input_shape": [null, 40, 256, 3], "name": "Preprocess", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>G\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": [40, 256, 3]}, "class_name": "Lambda"}, {"config": {"nb_filter": 24, "nb_row": 5, "subsample": [1, 1], "input_dtype": "float32", "border_mode": "valid", "name": "Conv2D1", "b_constraint": null, "batch_input_shape": [null, 40, 256, 3], "bias": true, "activation": "relu", "nb_col": 5, "trainable": true, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "strides": [2, 2], "border_mode": "valid", "name": "MaxPool1", "pool_size": [2, 2], "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"nb_filter": 36, "nb_row": 5, "subsample": [1, 1], "border_mode": "valid", "name": "Conv2D2", "b_constraint": null, "bias": true, "activation": "relu", "nb_col": 5, "trainable": true, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "strides": [2, 2], "border_mode": "valid", "name": "MaxPool2", "pool_size": [2, 2], "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"nb_filter": 48, "nb_row": 5, "subsample": [1, 1], "border_mode": "valid", "name": "Conv2D3", "b_constraint": null, "bias": true, "activation": "relu", "nb_col": 5, "trainable": true, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "b_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "strides": [2, 2], "border_mode": "valid", "name": "MaxPool3", "pool_size": [2, 2], "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "Flatten"}, "class_name": "Flatten"}, {"config": {"input_dim": 1344, "name": "FC2", "bias": true, "activation": "relu", "b_regularizer": null, "trainable": true, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "output_dim": 100, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"input_dim": 100, "name": "FC3", "bias": true, "activation": "relu", "b_regularizer": null, "trainable": true, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "output_dim": 50, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"input_dim": 50, "name": "FC4", "bias": true, "activation": "relu", "b_regularizer": null, "trainable": true, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "output_dim": 10, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"input_dim": 10, "name": "Readout", "bias": true, "activation": "linear", "b_regularizer": null, "trainable": false, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "b_constraint": null, "output_dim": 1, "init": "glorot_uniform"}, "class_name": "Dense"}], "class_name": "Sequential"}