{"config": [{"config": {"batch_input_shape": [null, 160, 320, 3], "input_dtype": "float32", "name": "Crop", "trainable": true, "cropping": [[80, 20], [1, 1]]}, "class_name": "Cropping2D"}, {"config": {"pool_size": [1, 4], "dim_ordering": "tf", "name": "Resize", "strides": [1, 4], "border_mode": "valid", "trainable": false}, "class_name": "AveragePooling2D"}, {"config": {"function_type": "lambda", "output_shape_type": "raw", "name": "Normalize", "arguments": {}, "output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u0007<stdin>\u00da\b<lambda>\u000b\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true}, "class_name": "Lambda"}, {"config": {"dim_ordering": "tf", "activation": "relu", "W_regularizer": null, "init": "glorot_uniform", "trainable": true, "bias": true, "name": "Convolution2D1", "nb_col": 3, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "nb_filter": 24, "b_regularizer": null, "nb_row": 3, "border_mode": "valid", "subsample": [2, 2]}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "dim_ordering": "tf", "name": "MaxPool1", "strides": [2, 2], "border_mode": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"dim_ordering": "tf", "activation": "relu", "W_regularizer": null, "init": "glorot_uniform", "trainable": true, "bias": true, "name": "Convolution2D2", "nb_col": 3, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "nb_filter": 36, "b_regularizer": null, "nb_row": 3, "border_mode": "valid", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "dim_ordering": "tf", "name": "MaxPool2", "strides": [2, 2], "border_mode": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"dim_ordering": "tf", "activation": "relu", "W_regularizer": null, "init": "glorot_uniform", "trainable": true, "bias": true, "name": "Convolution2D3", "nb_col": 3, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "nb_filter": 48, "b_regularizer": null, "nb_row": 3, "border_mode": "valid", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "dim_ordering": "tf", "name": "MaxPool3", "strides": [2, 2], "border_mode": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.1, "name": "Dropout", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "Flatten", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "relu", "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "name": "FC2", "input_dim": 288, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "output_dim": 100, "trainable": true}, "class_name": "Dense"}, {"config": {"activation": "relu", "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "name": "FC3", "input_dim": 100, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "output_dim": 50, "trainable": true}, "class_name": "Dense"}, {"config": {"activation": "relu", "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "name": "FC4", "input_dim": 50, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "output_dim": 10, "trainable": true}, "class_name": "Dense"}, {"config": {"activation": "linear", "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "name": "Readout", "input_dim": 10, "W_constraint": null, "b_constraint": null, "W_regularizer": null, "output_dim": 1, "trainable": false}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}