{"keras_version": "1.2.0", "config": [{"config": {"input_dtype": "float32", "name": "Crop", "batch_input_shape": [null, 160, 320, 3], "trainable": true, "cropping": [[80, 20], [1, 1]]}, "class_name": "Cropping2D"}, {"config": {"dim_ordering": "tf", "trainable": false, "strides": [1, 4], "border_mode": "valid", "name": "Resize", "pool_size": [1, 4]}, "class_name": "AveragePooling2D"}, {"config": {"axis": 1, "trainable": true, "epsilon": 0.001, "beta_regularizer": null, "mode": 0, "name": "Normalize", "momentum": 0.99, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"activation": "relu", "nb_row": 3, "trainable": true, "W_regularizer": null, "border_mode": "valid", "nb_filter": 24, "dim_ordering": "tf", "subsample": [2, 2], "W_constraint": null, "bias": true, "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "name": "Convolution2D1", "activity_regularizer": null, "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "trainable": true, "strides": [2, 2], "border_mode": "valid", "name": "MaxPool1", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"activation": "relu", "nb_row": 3, "trainable": true, "W_regularizer": null, "border_mode": "valid", "nb_filter": 36, "dim_ordering": "tf", "subsample": [1, 1], "W_constraint": null, "bias": true, "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "name": "Convolution2D2", "activity_regularizer": null, "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "trainable": true, "strides": [2, 2], "border_mode": "valid", "name": "MaxPool2", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"activation": "relu", "nb_row": 3, "trainable": true, "W_regularizer": null, "border_mode": "valid", "nb_filter": 48, "dim_ordering": "tf", "subsample": [1, 1], "W_constraint": null, "bias": true, "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "name": "Convolution2D3", "activity_regularizer": null, "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"dim_ordering": "tf", "trainable": true, "strides": [2, 2], "border_mode": "valid", "name": "MaxPool3", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "Dropout", "trainable": true, "p": 0.1}, "class_name": "Dropout"}, {"config": {"name": "Flatten", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "relu", "input_dim": 288, "b_regularizer": null, "W_constraint": null, "trainable": true, "bias": true, "b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "name": "FC2", "activity_regularizer": null, "output_dim": 100}, "class_name": "Dense"}, {"config": {"activation": "relu", "input_dim": 100, "b_regularizer": null, "W_constraint": null, "trainable": true, "bias": true, "b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "name": "FC3", "activity_regularizer": null, "output_dim": 50}, "class_name": "Dense"}, {"config": {"activation": "relu", "input_dim": 50, "b_regularizer": null, "W_constraint": null, "trainable": true, "bias": true, "b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "name": "FC4", "activity_regularizer": null, "output_dim": 10}, "class_name": "Dense"}, {"config": {"activation": "linear", "input_dim": 10, "b_regularizer": null, "W_constraint": null, "trainable": false, "bias": true, "b_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "name": "Readout", "activity_regularizer": null, "output_dim": 1}, "class_name": "Dense"}], "class_name": "Sequential"}