{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Cropping2D", "config": {"batch_input_shape": [null, 160, 320, 3], "cropping": [[80, 20], [1, 1]], "name": "Crop", "trainable": true, "input_dtype": "float32"}}, {"class_name": "AveragePooling2D", "config": {"name": "Resize", "pool_size": [1, 4], "strides": [1, 4], "trainable": false, "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Lambda", "config": {"output_shape": null, "name": "Normalize", "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0001\u0002\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "output_shape_type": "raw", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "init": "glorot_uniform", "b_regularizer": null, "bias": true, "b_constraint": null, "dim_ordering": "tf", "border_mode": "valid", "activation": "relu", "W_constraint": null, "nb_filter": 24, "nb_col": 3, "activity_regularizer": null, "name": "Convolution2D1", "W_regularizer": null, "trainable": true, "subsample": [2, 2]}}, {"class_name": "MaxPooling2D", "config": {"name": "MaxPool1", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "init": "glorot_uniform", "b_regularizer": null, "bias": true, "b_constraint": null, "dim_ordering": "tf", "border_mode": "valid", "activation": "relu", "W_constraint": null, "nb_filter": 36, "nb_col": 3, "activity_regularizer": null, "name": "Convolution2D2", "W_regularizer": null, "trainable": true, "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"name": "MaxPool2", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "init": "glorot_uniform", "b_regularizer": null, "bias": true, "b_constraint": null, "dim_ordering": "tf", "border_mode": "valid", "activation": "relu", "W_constraint": null, "nb_filter": 48, "nb_col": 3, "activity_regularizer": null, "name": "Convolution2D3", "W_regularizer": null, "trainable": true, "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"name": "MaxPool3", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "Dropout", "trainable": true, "p": 0.1}}, {"class_name": "Flatten", "config": {"name": "Flatten", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 100, "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "bias": true, "b_constraint": null, "trainable": true, "activation": "relu", "W_constraint": null, "input_dim": 288, "activity_regularizer": null, "name": "FC2"}}, {"class_name": "Dense", "config": {"output_dim": 50, "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "bias": true, "b_constraint": null, "trainable": true, "activation": "relu", "W_constraint": null, "input_dim": 100, "activity_regularizer": null, "name": "FC3"}}, {"class_name": "Dense", "config": {"output_dim": 10, "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "bias": true, "b_constraint": null, "trainable": true, "activation": "relu", "W_constraint": null, "input_dim": 50, "activity_regularizer": null, "name": "FC4"}}, {"class_name": "Dense", "config": {"output_dim": 1, "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "bias": true, "b_constraint": null, "trainable": false, "activation": "linear", "W_constraint": null, "input_dim": 10, "activity_regularizer": null, "name": "Readout"}}]}