{"config": [{"config": {"batch_input_shape": [null, 160, 320, 3], "name": "Crop", "input_dtype": "float32", "cropping": [[80, 20], [1, 1]], "trainable": true}, "class_name": "Cropping2D"}, {"config": {"strides": [1, 4], "border_mode": "valid", "dim_ordering": "tf", "trainable": false, "pool_size": [1, 4], "name": "Resize"}, "class_name": "AveragePooling2D"}, {"config": {"function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>~\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": null, "output_shape_type": "raw", "arguments": {}, "name": "Normalize", "trainable": true}, "class_name": "Lambda"}, {"config": {"init": "glorot_uniform", "border_mode": "valid", "b_constraint": null, "W_constraint": null, "nb_col": 3, "b_regularizer": null, "dim_ordering": "tf", "name": "Convolution2D1", "trainable": true, "W_regularizer": null, "nb_filter": 24, "activity_regularizer": null, "activation": "relu", "subsample": [2, 2], "bias": true, "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "trainable": true, "pool_size": [2, 2], "name": "MaxPool1"}, "class_name": "MaxPooling2D"}, {"config": {"init": "glorot_uniform", "border_mode": "valid", "b_constraint": null, "W_constraint": null, "nb_col": 3, "b_regularizer": null, "dim_ordering": "tf", "name": "Convolution2D2", "trainable": true, "W_regularizer": null, "nb_filter": 36, "activity_regularizer": null, "activation": "relu", "subsample": [1, 1], "bias": true, "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "trainable": true, "pool_size": [2, 2], "name": "MaxPool2"}, "class_name": "MaxPooling2D"}, {"config": {"init": "glorot_uniform", "border_mode": "valid", "b_constraint": null, "W_constraint": null, "nb_col": 3, "b_regularizer": null, "dim_ordering": "tf", "name": "Convolution2D3", "trainable": true, "W_regularizer": null, "nb_filter": 48, "activity_regularizer": null, "activation": "relu", "subsample": [1, 1], "bias": true, "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "trainable": true, "pool_size": [2, 2], "name": "MaxPool3"}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.1, "name": "Dropout", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "Flatten", "trainable": true}, "class_name": "Flatten"}, {"config": {"init": "glorot_uniform", "output_dim": 100, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "name": "FC2", "trainable": true, "input_dim": 288, "b_regularizer": null, "activity_regularizer": null, "activation": "relu", "bias": true}, "class_name": "Dense"}, {"config": {"init": "glorot_uniform", "output_dim": 50, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "name": "FC3", "trainable": true, "input_dim": 100, "b_regularizer": null, "activity_regularizer": null, "activation": "relu", "bias": true}, "class_name": "Dense"}, {"config": {"init": "glorot_uniform", "output_dim": 10, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "name": "FC4", "trainable": true, "input_dim": 50, "b_regularizer": null, "activity_regularizer": null, "activation": "relu", "bias": true}, "class_name": "Dense"}, {"config": {"init": "glorot_uniform", "output_dim": 1, "b_constraint": null, "W_constraint": null, "W_regularizer": null, "name": "Readout", "trainable": false, "input_dim": 10, "b_regularizer": null, "activity_regularizer": null, "activation": "linear", "bias": true}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}