{"config": [{"config": {"batch_input_shape": [null, 160, 320, 3], "input_dtype": "float32", "trainable": true, "name": "Crop", "cropping": [[80, 20], [1, 1]]}, "class_name": "Cropping2D"}, {"config": {"border_mode": "valid", "trainable": false, "name": "Resize", "pool_size": [1, 4], "dim_ordering": "tf", "strides": [1, 4]}, "class_name": "AveragePooling2D"}, {"config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u0007<stdin>\u00da\b<lambda>\u000b\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "name": "Normalize", "output_shape": null, "function_type": "lambda", "arguments": {}, "output_shape_type": "raw"}, "class_name": "Lambda"}, {"config": {"activation": "relu", "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "W_constraint": null, "W_regularizer": null, "subsample": [2, 2], "border_mode": "valid", "bias": true, "name": "Convolution2D1", "activity_regularizer": null, "nb_row": 3, "nb_filter": 24, "nb_col": 3, "dim_ordering": "tf", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "trainable": true, "name": "MaxPool1", "pool_size": [2, 2], "dim_ordering": "tf", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"activation": "relu", "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "W_constraint": null, "W_regularizer": null, "subsample": [1, 1], "border_mode": "valid", "bias": true, "name": "Convolution2D2", "activity_regularizer": null, "nb_row": 3, "nb_filter": 36, "nb_col": 3, "dim_ordering": "tf", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "trainable": true, "name": "MaxPool2", "pool_size": [2, 2], "dim_ordering": "tf", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"activation": "relu", "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "W_constraint": null, "W_regularizer": null, "subsample": [1, 1], "border_mode": "valid", "bias": true, "name": "Convolution2D3", "activity_regularizer": null, "nb_row": 3, "nb_filter": 48, "nb_col": 3, "dim_ordering": "tf", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "trainable": true, "name": "MaxPool3", "pool_size": [2, 2], "dim_ordering": "tf", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.1, "trainable": true, "name": "Dropout"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "Flatten"}, "class_name": "Flatten"}, {"config": {"activation": "relu", "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "W_constraint": null, "output_dim": 100, "activity_regularizer": null, "bias": true, "name": "FC2", "W_regularizer": null, "input_dim": 288, "b_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "W_constraint": null, "output_dim": 50, "activity_regularizer": null, "bias": true, "name": "FC3", "W_regularizer": null, "input_dim": 100, "b_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "W_constraint": null, "output_dim": 10, "activity_regularizer": null, "bias": true, "name": "FC4", "W_regularizer": null, "input_dim": 50, "b_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "linear", "b_regularizer": null, "trainable": false, "init": "glorot_uniform", "W_constraint": null, "output_dim": 1, "activity_regularizer": null, "bias": true, "name": "Readout", "W_regularizer": null, "input_dim": 10, "b_constraint": null}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}