{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"bias": true, "b_regularizer": null, "activity_regularizer": null, "activation": "linear", "b_constraint": null, "name": "convolution2d_1", "init": "glorot_uniform", "nb_row": 3, "input_dtype": "float32", "dim_ordering": "tf", "border_mode": "valid", "batch_input_shape": [null, 32, 32, 3], "nb_filter": 32, "trainable": true, "subsample": [1, 1], "W_constraint": null, "nb_col": 3, "W_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_1", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias": true, "b_regularizer": null, "activity_regularizer": null, "activation": "relu", "b_constraint": null, "name": "dense_1", "init": "glorot_uniform", "output_dim": 128, "trainable": true, "input_dim": 7200, "W_constraint": null, "W_regularizer": null}}, {"class_name": "Dense", "config": {"bias": true, "b_regularizer": null, "activity_regularizer": null, "activation": "softmax", "b_constraint": null, "name": "dense_2", "init": "glorot_uniform", "output_dim": 43, "trainable": true, "input_dim": 128, "W_constraint": null, "W_regularizer": null}}]}