{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Lambda", "config": {"output_shape_type": "raw", "input_dtype": "float32", "arguments": {}, "trainable": false, "batch_input_shape": [null, 80, 160, 3], "function_type": "lambda", "output_shape": [80, 160, 3], "name": "Preprocess", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\n./model.py\u00da\b<lambda>-\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "W_constraint": null, "batch_input_shape": [null, 80, 160, 3], "dim_ordering": "tf", "activation": "relu", "subsample": [1, 1], "name": "Conv2D1", "nb_filter": 6, "b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "nb_row": 3, "input_dtype": "float32", "bias": true, "border_mode": "valid", "activity_regularizer": null, "trainable": true, "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "border_mode": "valid", "name": "MaxPool1", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "W_constraint": null, "activation": "relu", "dim_ordering": "tf", "subsample": [1, 1], "name": "Conv2D2", "b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "nb_row": 3, "nb_filter": 10, "trainable": true, "border_mode": "valid", "activity_regularizer": null, "bias": true, "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "border_mode": "valid", "name": "MaxPool2", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "W_constraint": null, "activation": "relu", "dim_ordering": "tf", "subsample": [1, 1], "name": "Conv2D3", "b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "nb_row": 3, "nb_filter": 16, "trainable": true, "border_mode": "valid", "activity_regularizer": null, "bias": true, "b_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "border_mode": "valid", "name": "MaxPool3", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "Flatten", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "input_dim": 2304, "name": "FC1", "activation": "relu", "b_regularizer": null, "bias": true, "W_regularizer": null, "output_dim": 128, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "b_constraint": null}}, {"class_name": "Dense", "config": {"W_constraint": null, "input_dim": 128, "name": "FC2", "activation": "relu", "b_regularizer": null, "bias": true, "W_regularizer": null, "output_dim": 64, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "b_constraint": null}}, {"class_name": "Dense", "config": {"W_constraint": null, "input_dim": 64, "name": "FC3", "activation": "relu", "b_regularizer": null, "bias": true, "W_regularizer": null, "output_dim": 32, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "b_constraint": null}}, {"class_name": "Dense", "config": {"W_constraint": null, "input_dim": 32, "name": "FC4", "activation": "relu", "b_regularizer": null, "bias": true, "W_regularizer": null, "output_dim": 16, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "b_constraint": null}}, {"class_name": "Dense", "config": {"W_constraint": null, "input_dim": 16, "name": "FC5", "activation": "relu", "b_regularizer": null, "bias": true, "W_regularizer": null, "output_dim": 8, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "b_constraint": null}}, {"class_name": "Dropout", "config": {"name": "Dropout", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "input_dim": 8, "name": "Readout", "activation": "sigmoid", "b_regularizer": null, "bias": true, "W_regularizer": null, "output_dim": 1, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "b_constraint": null}}, {"class_name": "Lambda", "config": {"output_shape_type": "raw", "function_type": "lambda", "arguments": {}, "output_shape": null, "name": "Postprocess", "trainable": false, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000d\u0001\u0000|\u0000\u0000\u0014d\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u0000@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\n./model.py\u00da\b<lambda><\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}}]}