{"config": [{"config": {"trainable": false, "strides": [1, 4], "batch_input_shape": [null, 60, 320, 3], "name": "Resize", "dim_ordering": "tf", "pool_size": [1, 4], "border_mode": "valid", "input_dtype": "float32"}, "class_name": "AveragePooling2D"}, {"config": {"trainable": true, "function_type": "lambda", "name": "Normalize", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u00a5\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "output_shape": null, "output_shape_type": "raw"}, "class_name": "Lambda"}, {"config": {"trainable": true, "activity_regularizer": null, "b_constraint": null, "subsample": [2, 2], "name": "Conv2D1", "b_regularizer": null, "bias": true, "border_mode": "valid", "nb_col": 3, "activation": "relu", "nb_row": 3, "W_constraint": null, "nb_filter": 24, "init": "glorot_uniform", "W_regularizer": null, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "strides": [2, 2], "name": "MaxPool1", "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "activity_regularizer": null, "b_constraint": null, "subsample": [1, 1], "name": "Conv2D2", "b_regularizer": null, "bias": true, "border_mode": "valid", "nb_col": 3, "activation": "relu", "nb_row": 3, "W_constraint": null, "nb_filter": 36, "init": "glorot_uniform", "W_regularizer": null, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "strides": [2, 2], "name": "MaxPool2", "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "p": 0.1, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "Flatten"}, "class_name": "Flatten"}, {"config": {"trainable": true, "activity_regularizer": null, "input_dim": 1728, "name": "FC2", "b_regularizer": null, "bias": true, "b_constraint": null, "activation": "relu", "W_constraint": null, "init": "glorot_uniform", "output_dim": 100, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activity_regularizer": null, "input_dim": 100, "name": "FC3", "b_regularizer": null, "bias": true, "b_constraint": null, "activation": "relu", "W_constraint": null, "init": "glorot_uniform", "output_dim": 50, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "activity_regularizer": null, "input_dim": 50, "name": "FC4", "b_regularizer": null, "bias": true, "b_constraint": null, "activation": "relu", "W_constraint": null, "init": "glorot_uniform", "output_dim": 10, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": false, "activity_regularizer": null, "input_dim": 10, "name": "Readout", "b_regularizer": null, "bias": true, "b_constraint": null, "activation": "linear", "W_constraint": null, "init": "glorot_uniform", "output_dim": 1, "W_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}