{"config": [{"config": {"batch_input_shape": [null, 64, 64, 3], "trainable": false, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>A\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": [64, 64, 3], "output_shape_type": "raw", "input_dtype": "float32", "function_type": "lambda", "arguments": {}, "name": "Preprocess"}, "class_name": "Lambda"}, {"config": {"init": "glorot_uniform", "nb_col": 5, "input_dtype": "float32", "W_constraint": null, "b_regularizer": null, "bias": true, "name": "Conv2D1", "subsample": [2, 2], "batch_input_shape": [null, 64, 64, 3], "border_mode": "valid", "nb_filter": 24, "activation": "relu", "activity_regularizer": null, "dim_ordering": "tf", "nb_row": 5, "trainable": true, "b_constraint": null, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"init": "glorot_uniform", "nb_col": 5, "b_regularizer": null, "bias": true, "name": "Conv2D2", "subsample": [2, 2], "border_mode": "valid", "activation": "relu", "nb_filter": 36, "dim_ordering": "tf", "activity_regularizer": null, "W_constraint": null, "nb_row": 5, "trainable": true, "b_constraint": null, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"init": "glorot_uniform", "nb_col": 5, "b_regularizer": null, "bias": true, "name": "Conv2D3", "subsample": [2, 2], "border_mode": "valid", "activation": "relu", "nb_filter": 48, "dim_ordering": "tf", "activity_regularizer": null, "W_constraint": null, "nb_row": 5, "trainable": true, "b_constraint": null, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"init": "glorot_uniform", "nb_col": 5, "b_regularizer": null, "bias": true, "name": "Conv2D4", "subsample": [1, 1], "border_mode": "valid", "activation": "relu", "nb_filter": 64, "dim_ordering": "tf", "activity_regularizer": null, "W_constraint": null, "nb_row": 5, "trainable": true, "b_constraint": null, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "Flatten"}, "class_name": "Flatten"}, {"config": {"output_dim": 100, "W_regularizer": null, "b_regularizer": null, "bias": true, "input_dim": 64, "name": "FC2", "W_constraint": null, "activity_regularizer": null, "activation": "relu", "b_constraint": null, "trainable": true, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"output_dim": 50, "W_regularizer": null, "b_regularizer": null, "bias": true, "input_dim": 100, "name": "FC3", "W_constraint": null, "activity_regularizer": null, "activation": "relu", "b_constraint": null, "trainable": true, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"output_dim": 10, "W_regularizer": null, "b_regularizer": null, "bias": true, "input_dim": 50, "name": "FC4", "W_constraint": null, "activity_regularizer": null, "activation": "relu", "b_constraint": null, "trainable": true, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"output_dim": 1, "W_regularizer": null, "b_regularizer": null, "bias": true, "input_dim": 10, "name": "Readout", "W_constraint": null, "activity_regularizer": null, "activation": "linear", "b_constraint": null, "trainable": false, "init": "glorot_uniform"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}