{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Cropping2D", "config": {"batch_input_shape": [null, 160, 320, 3], "input_dtype": "float32", "trainable": true, "name": "Crop", "cropping": [[1, 1], [80, 20]]}}, {"class_name": "AveragePooling2D", "config": {"pool_size": [1, 4], "border_mode": "valid", "strides": [1, 4], "name": "Resize", "trainable": false, "dim_ordering": "tf"}}, {"class_name": "Lambda", "config": {"arguments": {}, "function_type": "lambda", "name": "Normalize", "output_shape": null, "output_shape_type": "raw", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0090\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_constraint": null, "W_regularizer": null, "nb_row": 3, "name": "Convolution2D1", "activation": "relu", "nb_col": 3, "trainable": true, "dim_ordering": "tf", "border_mode": "valid", "init": "glorot_uniform", "b_constraint": null, "subsample": [2, 2], "nb_filter": 24, "bias": true, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "name": "MaxPool1", "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_constraint": null, "W_regularizer": null, "nb_row": 3, "name": "Convolution2D2", "activation": "relu", "nb_col": 3, "trainable": true, "dim_ordering": "tf", "border_mode": "valid", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "nb_filter": 36, "bias": true, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "name": "MaxPool2", "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_constraint": null, "W_regularizer": null, "nb_row": 3, "name": "Convolution2D3", "activation": "relu", "nb_col": 3, "trainable": true, "dim_ordering": "tf", "border_mode": "valid", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "nb_filter": 48, "bias": true, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "name": "MaxPool3", "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"p": 0.1, "trainable": true, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "Flatten"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "W_constraint": null, "W_regularizer": null, "name": "FC2", "activation": "relu", "input_dim": 384, "trainable": true, "init": "glorot_uniform", "b_constraint": null, "bias": true, "activity_regularizer": null, "output_dim": 100}}, {"class_name": "Dense", "config": {"b_regularizer": null, "W_constraint": null, "W_regularizer": null, "name": "FC3", "activation": "relu", "input_dim": 100, "trainable": true, "init": "glorot_uniform", "b_constraint": null, "bias": true, "activity_regularizer": null, "output_dim": 50}}, {"class_name": "Dense", "config": {"b_regularizer": null, "W_constraint": null, "W_regularizer": null, "name": "FC4", "activation": "relu", "input_dim": 50, "trainable": true, "init": "glorot_uniform", "b_constraint": null, "bias": true, "activity_regularizer": null, "output_dim": 10}}, {"class_name": "Dense", "config": {"b_regularizer": null, "W_constraint": null, "W_regularizer": null, "name": "Readout", "activation": "linear", "input_dim": 10, "trainable": false, "init": "glorot_uniform", "b_constraint": null, "bias": true, "activity_regularizer": null, "output_dim": 1}}]}